#Week 12

#45: Memadukan loc and iloc untuk seleksi data

Import Modules

In [1]:
import pandas as pd

print(pd.__version__)

1.3.4

Persiapkan Data Frame

In [2]:
df = pd.read_csv('./titanic3.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

Memadukan loc and iloc untuk seleksi data

In [3]:
df.iloc[15:20, :].loc[:, 'name':'age']

                                               name     sex   age
15                              Baumann, Mr. John D    male   NaN
16                         Baxter, Mr. Quigg Edmond    male  24.0
17  Baxter, Mrs. James (Helene DeLaudeniere Chaput)  female  50.0
18                            Bazzani, Miss. Albina  female  32.0
19                             Beattie, Mr. Thomson    male  36.0

In [4]:
df.loc[:, 'name':'age'].iloc[15:20, :]

                                               name     sex   age
15                              Baumann, Mr. John D    male   NaN
16                         Baxter, Mr. Quigg Edmond    male  24.0
17  Baxter, Mrs. James (Helene DeLaudeniere Chaput)  female  50.0
18                            Bazzani, Miss. Albina  female  32.0
19                             Beattie, Mr. Thomson    male  36.0

#46: Seleksi weekdays dan weekends pada data deret waktu (time series)

Import Modules

In [5]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

Persiapkan Data Frame

In [8]:
n_rows =365
n_cols =2
cols = ['col1', 'col2']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows,n_cols)),
                  columns =cols)

df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df

D:\Anaconda\lib\site-packages\pandas\util\__init__.py:15: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

            col1  col2
2000-01-01     4    12
2000-01-02     2    16
2000-01-03    17     6
2000-01-04     4    14
2000-01-05     1    14
...          ...   ...
2000-12-26     5    18
2000-12-27    18    16
2000-12-28     5    19
2000-12-29    11     8
2000-12-30    15     5

[365 rows x 2 columns]

Seleksi Weekdays dan Weekends

In [9]:
weekdays_df = df[df.index.dayofweek.isin([0, 1 , 2 , 3 , 4])]
weekdays_df.head(7)

            col1  col2
2000-01-03    17     6
2000-01-04     4    14
2000-01-05     1    14
2000-01-06     2    10
2000-01-07     3    14
2000-01-10     8     9
2000-01-11     9    10

In [10]:
weekends_df = df[df.index.dayofweek.isin([5,6])]
weekends_df.head(7)

            col1  col2
2000-01-01     4    12
2000-01-02     2    16
2000-01-08     2     3
2000-01-09    15     7
2000-01-15    11     1
2000-01-16     7     8
2000-01-22    15    15

#47 Deteksi dan penanganan kolom dengan tipe data beragam (mixed data types)

Import Modules

In [11]:
import pandas as pd

print(pd.__version__)

1.3.4

Persiapkan Data Frame

In [12]:
d = {'nama' :['bejo', 'tejo', 'wati', 'tiwi', 'cecep',],
     'ipk':[2,'3', 3, 2.75, '3.25']}
df = pd.DataFrame(d)
df

    nama   ipk
0   bejo     2
1   tejo     3
2   wati     3
3   tiwi  2.75
4  cecep  3.25

Deteksi dan penanganan kolom dengan tipe data beragam (Mixed Data Types)

In [13]:
df.dtypes

nama    object
ipk     object
dtype: object

In [14]:
df['ipk'].apply(type)

0      <class 'int'>
1      <class 'str'>
2      <class 'int'>
3    <class 'float'>
4      <class 'str'>
Name: ipk, dtype: object

In [15]:
df['ipk'].apply(type).value_counts()

<class 'int'>      2
<class 'str'>      2
<class 'float'>    1
Name: ipk, dtype: int64

In [16]:
df['ipk'] = df['ipk'].astype(float)

In [17]:
df['ipk'].apply(type).value_counts()

<class 'float'>    5
Name: ipk, dtype: int64

#48: Mengenal Cummulative Count dengan cumcount()

Import Modules

In [18]:
import pandas as pd

print(pd.__version__)

1.3.4

Persiapkan Data Frame

In [19]:
d = {'penjual': ['bejo', 'tejo', 'wati', 'bejo', 'cecep', 'tejo', 'wati', 'bejo'],
     'barang' :['monitor', 'monitor', 'keyboard', 'mouse', 'keyboard', 'monitor', 'laptop', 'monitor']}
df = pd.DataFrame(d)
df

  penjual    barang
0    bejo   monitor
1    tejo   monitor
2    wati  keyboard
3    bejo     mouse
4   cecep  keyboard
5    tejo   monitor
6    wati    laptop
7    bejo   monitor

Mengenal cummulative Count dengan cumcount()

In [20]:
df['count_tiap_penjual'] = df.groupby('penjual').cumcount() + 1
df

  penjual    barang  count_tiap_penjual
0    bejo   monitor                   1
1    tejo   monitor                   1
2    wati  keyboard                   1
3    bejo     mouse                   2
4   cecep  keyboard                   1
5    tejo   monitor                   2
6    wati    laptop                   2
7    bejo   monitor                   3

In [21]:
df['count_tiap_barang'] = df.groupby('barang').cumcount() + 1
df

  penjual    barang  count_tiap_penjual  count_tiap_barang
0    bejo   monitor                   1                  1
1    tejo   monitor                   1                  2
2    wati  keyboard                   1                  1
3    bejo     mouse                   2                  1
4   cecep  keyboard                   1                  2
5    tejo   monitor                   2                  3
6    wati    laptop                   2                  1
7    bejo   monitor                   3                  4

In [22]:
df['count_pasangan_kolom'] = df.groupby(['penjual', 'barang']).cumcount() + 1
df

,penjual,barang,count_tiap_penjual,count_tiap_barang,count_pasangan_kolom
0,bejo,monitor,1,1,1
1,tejo,monitor,1,2,1
2,wati,keyboard,1,1,1
3,bejo,mouse,2,1,1
4,cecep,keyboard,1,2,1
5,tejo,monitor,2,3,2
6,wati,laptop,2,1,1
7,bejo,monitor,3,4,2